wisteria-1c/Конфигурация/Catalogs/ХранилищеШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХранилищеШаблонов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПользовательСоздал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПользовательИзменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКоличествоПоВертикали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКоличествоПоГоризонтали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УдалитьУсловиеВыводаСекцииШаблона</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСравнения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УдалитьЗначениеУсловияВыводаШаблон</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаЦенник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаЦенникПринтераЭтикеток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаКодМаркировкиИСМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЧекККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляШтрихкодовУпаковок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ХранилищеШаблонов/Forms/ФормаШтрихкодыЭтикетокИСМП/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СразуНаПринтер        = Параметры.СразуНаПринтер;
	ШаблонЭтикетки        = Параметры.ШаблонЭтикетки;
	ИмяМакета           = Параметры.ИмяМакета;
	
	ДанныеПечати = Неопределено;
	Если ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда
		ДанныеПечати = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ИмяМакета = "ЭтикеткаКодМаркировкиИСМП" Тогда
		Заголовок = НСтр("ru = 'Выбор шаблона этикетки'");
		Элементы.СразуНаПринтер.Видимость = Истина;
		ОтборШаблона = Новый ПараметрВыбора("Отбор.ТипШаблона",
			Перечисления.ТипыШаблонов.ЭтикеткаКодМаркировкиИСМП);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДанныеПечати, УникальныйИдентификатор);
	ИначеЕсли ИмяМакета = "ЭтикеткаШтрихкодыУпаковки" Тогда
		Заголовок = НСтр("ru = 'Выбор шаблона этикетки упаковки'");
		Элементы.СразуНаПринтер.Видимость = Ложь;
		ОтборШаблона = Новый ПараметрВыбора("Отбор.ТипШаблона",
			Перечисления.ТипыШаблонов.ЭтикеткаДляШтрихкодовУпаковок);
		ШтрихкодыУпаковок.Загрузить(ДанныеПечати);
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ОтборШаблона);
	Элементы.ШаблонЭтикетки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	
	ПараметрыПечати = ПараметрыПечати();
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьЭтикетокИЦенников",
		ИмяМакета,
		ПараметрКоманды,
		ВладелецФормы,
		ПараметрыПечати);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыПечати()
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("КоличествоЭкземпляров", 1);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП");
	
	Если ИмяМакета = "ЭтикеткаКодМаркировкиИСМП" Тогда
		ПараметрыПечати.Вставить("АдресВХранилище", "");
		ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Истина);
		ПараметрыПечати.Вставить("СразуНаПринтер", СразуНаПринтер);
		
		ДанныеПечати = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Для Каждого СтрокаПечати Из ДанныеПечати.ОбъектыПечати Цикл
			СтрокаПечати.ШаблонЭтикетки = ШаблонЭтикетки;
		КонецЦикла;
		ПараметрыПечати.Вставить("СтруктураДанных", ДанныеПечати);
	ИначеЕсли ИмяМакета = "ЭтикеткаШтрихкодыУпаковки" Тогда
		ПараметрыПечати.Вставить("ШаблонЭтикетки",         ШаблонЭтикетки);
		ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
		ПараметрыПечати.Вставить("ИсходныеДанные",
			ЗначениеВСтрокуВнутр(ШтрихкодыУпаковок.Выгрузить()));
	КонецЕсли;
	
	Возврат ПараметрыПечати;
	
КонецФункции

#КонецОбласти
